app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-10-17 23:01:08.446698"], ["updated_at", "2018-10-17 23:01:08.446698"]]
---
  def upload
    CSV.foreach(params[:songs].path) do |song|
      Song.create(song_params)